[{
    "name":"Analytics And Business Intelligence",
    "other_names":"",
    "short_desc":"Provides data-driven insights about business processes, performance and predictive modelling.",
    "full_description":"The analytics and business intelligence services ICT Building Blocks enables comprehensive services providing important data-driven insights about the current state of an organization’s business. It also identifies trends to help users understand information that can drive business change and support sustainable and successful business practices. These services can aggregate, transform and extract features from data, as well as analyzing them to identify specific patterns and classifications. They can either operate on data stored in various repositories and registries, or process real-time data streams passing through the platform from one application to another. For analytics processing, warehouses are an essential component. Warehouses copy and aggregate data from collection tools and backend data repositories into a database designed specifically for analytical purposes. By doing so, these warehouses transform the data from multiple sources into formats suitable for analysis, helping optimize analytical queries and creating outputs more efficiently without affecting the performance of other applications. Web interfaces and external data visualization applications allow end-users to view the analytic outputs.",
    "digital_function":"• Provides a user interface (UI) to access and work within the software environment • Provides an administrative function to define user rights and accessibility control • Provides artificial intelligence tools for analysis and manipulation of data • Sets business rules and algorithms • Provides data visualization and rendering • Aggregates datasets from various sources into a warehouse database that organizes the data into corresponding groups identified for specific analysis • Processes raw data to find and remove noise, artefacts, etc, and to clean the data • Extracts specific features from data and feature sets • Combines feature sets subject to numerical or logical boundary conditions based on preconfigured rules • Classifies threshold outcomes and triggers corresponding responses in other applications based on classification rules",
    "sector_use":[{"name":"Agriculture sector","description":"Use for conducting root cause analysis of problems and applying predictive analytics in order to make appropriate interventions in time, as well as to make informed decisions while implementing various schemes. Examples include: • Analysis of trends of cropped areas and the economics of various crop districts in order to optimize crop area planning and to give advice to farmers • Analysis of soil health records along with the crops grown during the period, rainfall and irrigation amounts, yield, and other parameters, in order to plan how to maximize micronutrient corrections through focused interventions • Prediction of commodity prices, disseminating information to farmers so they can make informed decisions on storage and future sales of non-perishable agricultural produce • Real-time analysis of climatic conditions and early detection of sporadic pests and other pertinent parameters to predict pest attacks on agricultural crops and fish or prawn ponds. Use data to improve preparedness for these pest infestations by issuing advisories to farmers and by adequately stocking the materials required to mitigate these attacks"},
        {"name":"Education sector","description":"Use in supply chain management systems for optimizing distribution of equipment, such as desks and textbooks to schools and learning institutions • Track analytics on learner performance, providing diagnostic information to guide future learning interventions • Track teacher professional development based on self-diagnostic assessment and development of professional learning pathways"},
        {"name":"Health sector","description":"• Disease surveillance systems can use analytics and business intelligence services to identify disease incidence, morbidity/mortality rates, density, distribution, etc • Supply chain management systems can use them to optimize shipment logistics for efficient delivery and inventory management • Point-of-service data analysis can help optimize health commodities production and demand-based pricing • Health insurance companies can use this for risk analysis and region- or disease- based optimization of insurance plans"}
    ],
    "existing_software":["Microsoft Power BI","Tableau"],
    "workflow_mappings":["Data analysis and business intelligence"]
},{
    "name":"Artificial Intelligence",
    "other_names":"Machine learning, Deep learning, Smart systems, Intelligent machines",
    "short_desc":"Machine intelligence capabilities packaged as reusable services to perform work, extract insights from data, or provide other business capabilities.",
    "full_description":"AI (artificial intelligence) is the process by which learning, pattern matching, and recognition and evolution of rules by inference takes place by mathematical modelling , filtering and classification algorithms on computer systems. These processes include learning (the acquisition of information and rules for using the information), reasoning (using the rules to reach approximate or definite conclusions) and self-correction. Examples of emerging AI services include: • Natural language processing (NLP) • Machine translation • Image recognition • Text-to-speech conversion",
    "digital_function":"• Offers sensing or data capture and transmission by machine to machine (eg functionalities sensors) or humans to machine (eg data input) • Provides controllers to manipulate data collection tools and external systems in a predefined or adaptive way to achieve the desired result (eg a mail sorter rotating its bar code scanner each time an envelope appears on the scanning console) • Includes metadata standards and definitions to classify and index data in storage • Provides cognition and machine learning to understand input data in various contexts (eg hyper spectral image analysis to infer plant health conditions) • Offers logic and decision-making based on algorithms • Provides modelling, using data, algorithms and deep learning to predict outcomes or initiate action",
    "sector_use":[{"name":"Agriculture sector","description":"• Smart and precision agriculture applications use artificial intelligence to interpret data captured by other machines (eg drones or sensors) and create models and strategic inferences (eg whether to initiate harvesting or pesticide spray) and activate other smart machines (eg a remote operated pump-set to start irrigation of fields, farm robots or self-driven tractors) • Machine vision (image recognition) for diagnosing pests or soil defects"},
        {"name":"Education sector","description":"• Intelligent tutoring systems that work with learners directly and provide support to teachers on personalized learning support strategies • Artificially intelligent assessment software to support adaptive, personalized learning"},
        {"name":"Health sector","description":"• Clinical decision support systems that assist doctors in diagnosing a patient’s disease condition and related intervention • Rehabilitation tools for patients with stroke, Alzheimer’s, autism, etc • AI can also help insurance companies detect high-yield and low-risk ROI patterns or fraud across various claim settlements"}
    ],
    "existing_software":["Google TensorFlow"],
    "workflow_mappings":["Data analysis and business intelligence","Problem diagnosis"]
},{
    "name":"Client Case Management",
    "other_names":"Beneficiary case management",
    "short_desc":"Registration or enrolment of a client and the longitudinal tracking of services for the client, often across multiple service categories, providers and locations.",
    "full_description":"The client case management services ICT Building Blocks enables the enrolment of a client in an organization’s services. It also enables the longitudinal tracking of services for the client, often across multiple service categories, providers and locations. Common case management activities include the capture of client identification and demographic information, appointment and event scheduling, messaging and reminders, management and prioritization of tasks across multiple cases, and summarizing client case data for reporting. Case managers commonly employ one or more job aids, each facilitating a particular service and potentially customized according to client attributes.",
    "digital_function":"• Registers clients via phone, SMS, web, etc and updates records when needed functionalities • Sends predefined messages to subscribers based on rules and data triggers • Sends automated triggers to external systems based on data updates • Schedules activities based on rules and triggers • Generates activity lists and loads job aids based on scheduled activities • Manages multiple cases and prioritizes action • Summarizes client case data for reporting",
    "sector_use":[{"name":"Agriculture sector", "description":"• Once farmers are registered for a rural advisory service, they are regularly provided information and interventions on various aspects of farming"},
        {"name":"Education sector","description":"• Learner profiles are tracked from students’ first enrolment throughout their schooling careers"},
        {"name":"Health sector","description":"• Pregnancy and birth registration, as well as longitudinal tracking of antenatal and postnatal visits"}
    ],
    "existing_software":["Dimagi CommCare"],
    "workflow_mappings":["Client case management","Client communication","Client education"]
},{
    "name":"Collaboration Management",
    "other_names":"Groupware, Wiki, Online knowledge sharing platform",
    "short_desc":"Enables multiple users to simultaneously access, modify or contribute to a single activity, such as content creation, through a unified access portal.",
    "full_description":"The collaboration management services ICT Building Blocks enables the sharing, processing and management of files, documents and other data types among several users or systems in order to help people involved in a common task achieve their goals. In terms of the level of interaction it allows, this ICT Building Blocks may be divided into real-time collaborative editing (RTCE) platforms that allow multiple users to engage in live, simultaneous and reversible editing of a single file (usually a document), and version control (also known as revision control and source control) platforms. These platforms allow separate users to make parallel edits to a file, while preserving every saved edit by every user as multiple files that are variants of the original file.",
    "digital_function":"• Provides a user interface (UI) to access and work within the software environment • Requires user identification and authentication, mostly using a token-based authentication system • Provides an administrative function that defines user rights and accessibility control • Facilitates integration with social media and discussion forums for live discussion threads • Helps users organize or participate in webinars and knowledge sharing platforms • Facilitates information sharing, including multimedia-based information eg video, audio and photos. • Provides an HTML-based rich text editor • Offers a version control system • Enables peer-to-peer messaging • Provides audio/video conferencing",
    "sector_use":[{"name":"Agriculture sector", "description": "• Agri-Wikis (eg Agropedia) help agriculture research and development (ARD) and agriculture extension communities collaboratively develop knowledge packages for farmers"},
        {"name":"Education sector","description":"• User-generated content produced by learners, teachers and management can be uploaded to education portals that service various education communities"}
    ],
    "existing_software":["Google Drive","Microsoft SharePoint"],
    "workflow_mappings":["Client case management"]
},{
    "name":"Consent Management",
    "other_names":"eApproval, Opt-in system",
    "short_desc":"Manages a set of policies allowing users to determine the information that will be accessible to specific potential information consumers, for which purpose, for how long and whether this information can be shared further.",
    "full_description":"The consent management services ICT Building Blocks allows an application or system to acquire and validate consent from an authorized user in order to grant access or permissions for carrying out a task. It allows users to take control of their data. Biometric identities, digital signatures or simply SMS messages may be used to provide consent. Consent services may also be integrated with security services to control access to user’s data and registry services, to record the user’s consent in the corresponding registry.",
    "digital_function":"• Users can record their consent using web-based or mobile applications • Users can digitally sign an electronic document that specifies who can use the data, for how long, and whether the information can be shared further • Users can access and manage their consent records for different services and can revoke their consent • Consents are stored in corresponding registries or in other data repositories, such as electronic health records • Allows for repeated expressions of consent, if required",
    "sector_use":[{"name":"Agriculture sector","description":"• Farmers can opt-in for push messaging services by sending an SMS with a keyword (eg YES) to a specific number. Alternatively, they place a missed call to a number or press a numeric key on their phone to indicate their consent to receive information from a specific source (eg RAS) • Generally, the opt-out process uses the exact same WorkFlow with different keywords (eg NO) or different keys to press"},
        {"name":"Education sector","description":"• Automated parental consent system for approving children’s participation in school activities"},
        {"name":"Health sector","description":"• Patients can grant consent to health professionals to collect, use or disclose their personal health data, whether it is stored in a local system or it needs to be transferred to other organizations • Consent can also be obtained to allow a certain clinical procedure to be performed"}
    ],
    "existing_software":[],
    "workflow_mappings":["Client case management","Identification and registration"]
},{
    "name":"Content Management",
    "other_names":"ePublication, Document management",
    "short_desc":"Supports the creation, editing, publication and management of digital media and other information.",
    "full_description":"The content management services ICT Building Blocks is used to create and manage digital content. It allows multiple users to create, access and share content in a collaborative environment. This ICT Building Blocks is typically used for enterprise content management (ECM) and web content management (WCM). Content management systems can be software as a service (SaaS) or platform as a service (PaaS).",
    "digital_function":"• Requires user ID and authentication for access control functionalities • Allows the administration and moderation of content creation, access and sharing • Enables web- or mobile-based user interfaces (UI) for content creation, editing, and managing version control, storage, access and sharing. Commonly known as content management application (CMA) • Offers a content delivery application (CDA) that delivers content to users and devices (eg website and mobiles) • Provides a content repository, which is a database to store content in digital format • Allows for the creation and management of websites by users with limited technical skills • Offers digital media converters that convert media according to the storage needs (eg reduce file size) or rendering needs (eg converting audio/video codec) of different access devices",
    "sector_use":[{"name":"Agriculture sector","description":"• Agriculture Wiki (eg Agropedia) • Create knowledge banks (eg IRRI Rice Knowledge Bank) • Collaborative knowledge sharing platforms, such as Global Open Data for Agriculture and Nutrition"},
        {"name":"Education sector","description":"• Ministry of education content portals that provide curriculum-aligned digital content, lesson plans, and exam papers for download by education communities"},
        {"name":"Health sector","description":"• Preventive care programmes can use these tools to raise awareness and spread information about medicines, diseases, lifestyle disorders, family planning, stress management, etc • CME programmes can use this tool to create or publish education and training content for students • Digital marketing can use content management services to manage advertisements as well as display and promote health messages, products and services"}
    ],
    "existing_software":["Drupal","WordPress"],
    "workflow_mappings":["Client case management","Client education","Content management","Knowledge management"]
},{
    "name":"Data Collection",
    "other_names":"Survey software, Enumeration application, Data point application",
    "short_desc":"Supports data collection from humans, sensors and other systems through digital interfaces.",
    "full_description":"Data collection is the process of gathering and measuring data, information or any variables of interest in a standardized and established manner that enables the collector to answer or test hypotheses as well as evaluate outcomes. Data collection can be machine-driven (automated or machine-level) or human-mediated. The data collection tools depend on the method of data collection and may vary widely from being a simple paper-based form to complex sensor-based systems.",
    "digital_function":"• Uses different data collection devices such as mobile phones, tablets and sensors functionalities • Requires identification and authentication to ensure that the system considers only data captured by authentic sources • Customizes data collection forms to enforce data quality, integrity and business Workflows • Collects multimedia content (eg video, audio and photos) and records geolocation coordinates • Uses a data collection form or interface that can include access to a camera or a sensor to capture ambient information • Sets data definitions and standards such as measurement system, format and nomenclature (eg population census, definition of income groups, standards related to type of housing, and terminology such as literate and semi-literate) • Provides data analytics tools to create statistics derived from collected data • Collects data offline and synchronizes data with a central data repository once connectivity is established • Provides safeguards against data loss • Provides access to data through APIs",
    "sector_use":[{"name":"Agriculture sector","description":"• Conduct farm surveys or agriculture census, collecting data via field sensors or remote sensing through satellite or drones"},
        {"name":"Education sector","description":"• Conduct whole school evaluation surveys by principals to ascertain school improvement needs"},
        {"name":"Health sector","description":"• Health census can use this in surveying demographic distribution of lifestyle habits, living conditions, disease incidence, mortality, morbidity, etc • Diagnostics and monitoring applications can use it to acquire health status and biomedical signals of patients • Real-time mapping of disease epidemics"}
    ],
    "existing_software":["Open Data Kit (ODK)"],
    "workflow_mappings":["Client case management","Client communication","Data collection and reporting"]
},{
    "name":"Digital Registries",
    "other_names":"Directories, Functional registries",
    "short_desc":"Registries are centrally managed databases that uniquely identify persons, vendors, facilities, procedures, products and sites related to an organization, industry or activity.",
    "full_description":"Registries store unique identifiers of persons, vendors, facilities, procedures, products and sites and are used to record and monitor resources and assets (physical or virtual). These resources are those that are used by a person, organization or industry, or they are consumed while performing certain activities. Registries store essential information for identification and verification purposes, such as name, biometrics/photos, location/contact details and basic profile of the person (eg age, sex qualification, etc), facility (eg type of entity, specialization) or thing (eg equipment type, serial number, warranty period).",
    "digital_function":"• Stores additional demographic or geographic information to facilitate the functionalities identification and access to the persons, vendors, facilities, etc • Provides a business rules engine used for saving the data in different tables or sub-registries with a predefined relationship • Uses a messaging component for notification of events (eg data created or updated successfully) • Provides various user interfaces for data input and output",
    "sector_use":[{"name":"Agriculture sector","description":"• Farmer, farm, facility or land registries, including GS1, the Global Farm Registry"},
        {"name":"Education sector","description":"• Registries of criminal offenders accessible to all education institutions • Registries of parent or guardian financial status with reference to school payment systems"},
        {"name":"Health sector","description":"• Facility registry – manages unique identifiers for health service delivery locations, including hospitals, clinics, pharmacies and standalone laboratories • Health worker registry (or provider registry) – manages unique identifiers for all types of health workers, including doctors, nurses, pharmacists, social workers, community health workers, and sometimes administrators. It is also called the Master Provider Index, which obtains provider identification information and can connect the provider to facility information • Patient registry – manages the unique identifiers of people receiving health services. It is also called the Master Patient Index (MPI), which maintains patient identification information and verifies the patient demographic data in a system"}
    ],
    "existing_software":["DHIS2","iHIRS"],
    "workflow_mappings":["Client case management","Client education","Data collection and reporting","Identification and registration","Marketplace"]
},{
    "name":"eLearning",
    "other_names":"Online learning, Mobile learning, Digital learning, Smart learning, Distance learning",
    "short_desc":"Supports facilitated or remote learning through digital interaction between educators and students.",
    "full_description":"The eLearning ICT Building Blocks enables a learning environment that uses ICT as a platform for teaching and learning activities. With its origins in distance learning, eLearning leverages new media, such as the Internet or mobile devices, to connect learners with educators. It breaks down the barriers to learning, such as distance, especially for adult learners in higher education or learners in remote areas. eLearning applications are available in software as a service (SaaS) or platform as a service (PaaS) forms.",
    "digital_function":"• Allows educators to create, curate and publish digital learning materials and functionalities programmes, including different types of learning activities • Uses or adapts existing content and multimedia materials, and organizes those materials into courses • Allows access to learning content and courses through different channels, including web, mobile apps and SMS • Enables the access, retrieval and delivery of information from educators to students, or between the learners themselves • Allows for online assessments and evaluation of students • Displays the applicable trainings based on the user profile, such as farmers and health workers • Allows authorized staff to receive feedback on the effectiveness of capacity- building programmes • Provides training schedule information to active or registered users by SMS or email • Offers access to learning content and courses through different channels, including web, mobile apps and SMS • Collects usage analytics to evaluate trainings and determine which materials work best • Includes a terminology library (thesaurus) • Provides a virtual classroom • Displays logistical and personnel information • Provides certification for successful completion of courses • Securely identifies and authenticates learners through biometrics, digital tokens, etc for assessment and certification purposes",
    "sector_use":[{"name":"Agriculture sector","description":"• Extension workers training programmes • Massive online open courses (MOOC) for agriculture"},
        {"name":"Education sector","description":"• Open distance and flexible learning systems (ODFL) offered by education institutions that enroll learners from remote, distant areas who can learn and submit assignments virtually, and universities offering MOOCs"},
        {"name":"Health sector","description":"• Continuing medical education (CME) for medical professionals and health workers • Tele-trainings for yoga or exercise • Remote training for college students in disaster management and first aid"}
    ],
    "existing_software":["MIT Open Course Ware","Moodle"],
    "workflow_mappings":["Client education","Knowledge management"]
},{
    "name":"eMarketplace",
    "other_names":"eTrading, eCommerce, Digital marketplace",
    "short_desc":"Provides a digital marketing space where provider entities can electronically advertise and sell products and services to other entities (B2B) or end-customers (B2C).",
    "full_description":"The eMarketplace services ICT Building Blocks enables various entities to publish their product/service catalogues and advertise their capabilities, facilities, etc on websites as well as through mobile messaging or apps. Such platforms provide many built-in capabilities for customers, such as product comparisons, electronic shopping baskets for aggregating customer selections, and order placement. The eMarketplace also helps vendors maintain a virtual inventory and manage shipments to the delivery agencies registered on the platform. This ICT Building Blocks may also enable multiple vendors to organize their products into package offerings with discounts, etc. Generally, the eMarketplace interfaces with billing and payment collection systems at the backend to ensure customers automatically obtain a price quote, complete a purchase and receive a receipt. Since the platform aggregates supply and demand, the customer is offered a wider range of choices, and vendors see their marketing overheads reduced.",
    "digital_function":"• Advertises products, services and vendors with regional tags and price tags functionalities • Allows customers to compare product offerings and make informed choices • Allows utilities to group the selection of different products from different vendors into a single order in the marketplace, and then distribute these orders to respective vendors on the backend • Provides unified billing and collection mechanisms to obtain customer payments and distribute the revenue to different vendors on the backend • Requests price quotes from suppliers to start negotiation processes • Provides statistical reports and transaction logs for audit or business intelligence services to help vendors optimize their inventory and product positioning",
    "sector_use":[{"name":"Agriculture sector","description":"• Many eMarketplaces exist for various agro-commodities managed by public entities (eg eNAM by the government of India)"},
        {"name":"Education sector","description":"• An eLearning marketplace in education can be used to provide a range of free and open education products and services that include user reviews for learners, parents, schools, teachers, researchers and education officials"},
        {"name":"Health sector","description":"• Medicine supply • Bio-medical equipment sales • Patient access to services such as physical assistance, transportation, diagnostics services, therapy services, consultation and counselling services"}
    ],
    "existing_software":["Esoko"],
    "workflow_mappings":["Financial services","Procurement"]
},{
    "name":"Geographic Information Services - GIS",
    "other_names":"Geolocation services",
    "short_desc":"Provides functionality to identify, tag and analyze geographic locations of an object, such as a water source, building, mobile phone or medical commodity.",
    "full_description":"The geographic information services ICT Building Blocks enables various applications to find and associate geographic locations with the identity of a person (eg patient, doctor, farmer, agricultural extensionist), facility (eg hospital, ambulance, lab, production facility), piece of equipment (eg ventilator, vaccine container), or location (eg water source, agricultural field). This association may also have a timestamp of when it was acquired and be tagged with a unique digital identifier. Applications or components using geographical information services can collect, share and use the temporal and spatial information with other applications, such as map repositories and data visualization tools, where it can be displayed on geographical maps. The data can alo be combined with other data such as population, surveillance, or supply chain data sets to enable geospatial and geotemporal analysis. Country’s differing data privacy policies may affect how much information geographical information services can gather.",
    "digital_function":"• Measures and tags location and timestamp information to specific data acquired functionalities from various applications • Searches and fetches data based on geospatial and geotemporal coordinates given by queries from other applications. • Allows for visualization and analysis of resources and/or human activity data by linking geographic information with descriptive information • Verifies and confirms the presence or absence of objects at specified locations or GPS coordinates",
    "sector_use":[{"name":"Agriculture sector","description":"• Critical for improving farm productivity, agri-insurance and traceability systems • Static GIS provides information about natural resource consumption and restoration (eg water harvesting) and land utilization and degradation (eg soil map) • Dynamic GIS provides information about crop sown areas to estimate productivity, crop damage to verify agri-insurance claims, and place of origin for agro-produce • GIS can keep land records, facilitate crop planning and manage the application of fertilizers based on soil conditions, water resource availability and agro-climatic conditions • Helps in crop acreage estimation, storage and logistics planning and the monitoring and forecasting of drought to help increase drought preparedness and identify and implement appropriate disaster risk reduction (DRR) measures"},
        {"name":"Education sector","description":"• Locate every private and public education institution • Communicates student enrolment data, grade level allocation, and student travel in a municipality, district or state"},
        {"name":"Health sector","description":"• Improve the identification of disease outbreak sources, supply chain bottlenecks, and structures in the built environment that impact health and wellness"}
    ],
    "existing_software":["Quantum GIS (QGIS)"],
    "workflow_mappings":["Data collection and reporting","Identification and registration","Supply chain management"]
},{
    "name":"Identification And Authentication",
    "other_names":"Identity management",
    "short_desc":"Enables unique identification and authentication of users, organizations and other entities.",
    "full_description":"Attribute a unique foundational ID to users, organizations or any other entities with the primary task of letting an entity prove who it is. According to the World Bank, digital foundational identity is one that is ‘built in a top-down manner with the objective of bolstering national development by creating a general-purpose identification for use across sectors. It also allows for proper authentication using passwords, One-time password/pin (OTP), biometrics, digital tokens, etc.",
    "digital_function":"• Foundational IDs come with no specified purpose or attached entitlement but functionalities simply let an entity prove who it is • Captures only limited information about users, such as name, date of birth, address and gender • For a given set of credentials, fetches a corresponding ID if it exists in the registry • Uses different biometric methods to identify and authenticate users through means other than user photographs (eg fingerprints, iris scans, facial recognition) to ensure there are no duplicates or fakes, creating a highly trustworthy database • This ICT Building Blocks also uses a publicly available interface, or open API, which allows any licensed service provider to verify if users are who they claim to be • Used to enable services such as opening bank accounts, buying SIM cards, receiving entitlements from the government, signing forms electronically, investing in mutual funds and getting credit • Incorporates privacy into its design when the purpose of the authentication is not revealed if a service provider sends an authentication request.",
    "sector_use":[{"name":"Agriculture sector","description":"The use of a foundational ID is cross-sectoral. It can be used to verify user identity and enable any service that a user has access credentials for, such as a fertilizer subsidy or food voucher."},
        {"name":"Health sector","description":"• Enterprise Master Patient Index"}
    ],
    "existing_software":["Apache Syncope","Modular Open Source Identification Platform (MOSIP, currently under development)"],
    "workflow_mappings":["Client case management","Client communication","Data collection and reporting","Financial services","Identification and registration","Knowledge management","Procurement","Supply chain management","Work planning and coordination"]
},{
    "name":"Information Mediator",
    "other_names":"Integration services",
    "short_desc":"Provides a gateway between external digital applications and other ICT Building Blocks, thereby ensuring interoperability and implementation of standards, which is essential for integrating various ICT Building Blocks and applications.",
    "full_description":"The information mediator services ICT Building Blocks enables the service consumer or requestor to connect to the correct service provider through the introduction of a reliable set of capabilities. Information mediator services act as a channel through which external applications connect to other ICT Building Blocks such as registry services, terminology services and repository services. They process, translate and log information transactions, as well as communication errors between applications and other ICT Building Blocks. They provide the capability of services mediation and orchestration, which includes transformation, routing and protocol conversion to transport service requests from the service requester to the correct service provider. Information mediator services can use standard APIs across the platform, reducing the need for each application or ICT Building Block to have its own API, thereby avoiding coding redundancy aand accelerating implementation. This component does not stand alone, however; it needs to be developed in conjunction with other core components, such as registries, repositories, etc. By allowing different applications to exchange information, it can act as a mechanism to encourage or enforce best practices, clinical guidelines, and policy, in cross-facility WorkFlows and business processes.",
    "digital_function":"• Routes requests to the correct provider after necessary message transformation functionalities and protocol conversion • Connects the service requestor to the service provider and its underlying solution platforms, realizing the requested service • Discovers services and, at runtime, to support the virtualization of services, so that changes to end-points can occur without impact to service consumers and service providers • Supports the handling of transactions and associated communication errors and exceptions • Enforces access privileges and other security policies • Maintains service invocation history and monitors and tracks service invocations • Provides local caching/broadcast/multicast capabilities to reduce repeated access to databases for the same information and to speed up data exchange • Translates data from one format to another, and interoperates with handshake protocols to enable interoperability between different ICT Building Blocks duplications",
    "sector_use":[{"name":"Health sector","description":"• The Health Information Access Layer (HIAL) in Canada provides communications services, common services and supporting components to broker data and service requests from point-of-service applications • It publishes a catalogue of available services, such as services to access registries and domain repositories (eg labs, drugs, diagnostic images) • A point-of-service system requests the ‘get lab results’ service for a healthcare client as part of the larger business service of managing lab results and reports • The system or user requesting the service does not need to know how to interface with the registries, domain repositories and applications; it just needs to know how to request a service that is exposed through the HIAL"}
    ],
    "existing_software":["OpenHIM"],
    "workflow_mappings":["Important in the integration ICT Building Blocks as part of any WorkFlow"]
},{
    "name":"Messaging",
    "other_names":"Instant messenger, Mobile message campaign manager, Message gateway, Mobile gateway",
    "short_desc":"Facilitates notifications, alerts and two-way communications between applications and communications services, including short message service (SMS), unstructured supplementary service data (USSD), interactive voice response (IVR), email and social media platforms.",
    "full_description":"Interactive communication services help digital applications communicate messages between users using mobile or other digital devices and other mobiles/devices/ backend enterprise applications based on specific triggering events. Based on the context and needs, the communication can be offline in the form of messages using telecom infrastructure, such as SMS, MMS, USSD, WhatsApp, Messenger, emails, social media, or live, video, audio, or chat sessions in real time. The communication may be initiated by events triggered by sensory or tracking devices, user activity or backend automation applications. The communication system may be preconfigured with indexed standard messages to automatically form and send appropriate messages based on events. Data repositories can be used to store the content of messages mediated via the interactive communication.",
    "digital_function":"• Send messages based on a predefined calendar or based on external conditions or functionalities triggers • Receive incoming messages, store them and trigger actions based on rules configured to identify either keywords contained in messages, senders or other conditions • Place users into groups based on their profile or other parameters and target them with specific messages • Create message flowcharts to determine which messages should be sent and to whom, based on users’ responses or external conditions • Track communication requests from external applications, along with message, message ID, and associated information that describes who to send the message to and via what type of communication method • Retrieve appropriate messages from a repository if the message index is received, then populate blank portions of the message with local contextual content, such as name, date and location • Encapsulate the content into formats based on the transmission protocols (phone or Internet) and send it securely through the appropriate corresponding backhaul infrastructure • Collect structured data for rapid analysis • Discover and connect to remote devices on the Internet, streaming real-time multimedia data with appropriate signalling protocols to ensure a timely end-to- end transfer of information that is both network failure resilient and bandwidth efficient • Measure and log metering parameters associated with the communication services used",
    "sector_use":[{"name":"Agriculture sector","description":"• Can be used for rural advisory services (RAS) operated by private and public agencies • Farmers subscribe to this service (paid or free) and receive information such as crop advisories, pest alerts and weather alerts • The information is transmitted through predesigned text or voice messages, or via queries to a data repository"},
        {"name":"Education sector","description":"• Messages via SMS or WhatsApp to enlist potential participants for an online or blended course • Formation of WhatsApp groups among course participants and course facilitators to exchange information, share experiences, collaborate on projects or communicate alerts about upcoming events or deliverables"},
        {"name":"Health sector","description":"• Send patients reminders for medication, diet, activity and appointments • Remotely track medical devices or take the vital signs of patients at home or in a remote hospital • Supply chain management systems can use messaging services to notify low stocks of inventory • It can also be used to announce new programmes, report on diseases, notify the public or individuals about events, and share public awareness content over mobile phones and social media"}
    ],
    "existing_software":["RapidPro","Twilio"],
    "workflow_mappings":["Client communication","Data collection and reporting","Financial services","Marketplace","Supply chain management"]
},{
    "name":"Mobility Management",
    "other_names":"Enterprise app store, Mobile device management (MDM), Mobile application management (MAM)",
    "short_desc":"Services to securely enable employees’ use and management of mobile devices and applications in a business context.",
    "full_description":"Given that most organizations and governments are adopting a ‘mobile first’ strategy, the management of mobile devices and applications as an enterprise or work tool is becoming crucial. Enterprise mobility management (EMM) services usually encompasses mobile device management (MDM), focusing on device-level control and security; mobile application management (MAM), focusing on applications management on the device; and an enterprise app store or other self-service portal, used for applications delivery and deployment.",
    "digital_function":"• Manages mobile devices at the enterprise through a single management console functionalities • Sets policies and configures settings by integrating with APIs built into mobile operating systems; an agent app is installed on the device to enforce these policies • Sets policies for a specific app or subset of apps, rather than for the whole device • Limits access and transmission of corporate data to approved applications only • Controls how, when and where workers may use corporate apps and data • Offers some user-friendly features, such as single sign-on • Captures geolocation of devices • Adds, updates and removes applications remotely from a device or group of devices • Wipes data or blocks device access in case of theft • Provides a dashboard with information on usage metrics as well as information about where devices are, with whom, and which applications are being used • Allows the download of only enterprise-approved applications on mobile devices from the enterprise app store • Prevents unauthorized access to enterprise applications and/or corporate data on mobile devices",
    "sector_use":[{"name":"Agriculture sector","description":"• EMM services are used to remotely manage and control devices used by agriculture extension workers to add, update or remove applications and to manage field workforce"},
        {"name":"Health sector","description":"• EMM services are used to remotely manage and control devices used by community health workers to add, update or remove applications and to manage field workforce"}
    ],
    "existing_software":["Microsoft Group Policy Management"],
    "workflow_mappings":["Client communication","Data collection and reporting","Identification and registration","Supply chain management"]
},{
    "name":"Payments",
    "other_names":"E-payments, Mobile wallets, Digital payments",
    "short_desc":"Implements financial transactions such as remittances, insurance claims, product purchases and payments of service fees, along with the logging of related transactional information. It also provides utilities for tracking costs and extracting audit trials.",
    "full_description":"The payments ICT Building Blocks enables digital financial payments to be tracked, evaluated, initiated, validated, processed, logged, compared and verified against operating costs. This ICT Building Blocks also provides interoperability with connections to the various external applications that need payment services in order to trigger transitions in their own WorkFlow. Payment services generally interface through gateways to regulated financial entities such as banks, credit facilities and insurance companies. To help users easily complete payment transactions and learn if their transaction succeeded or failed, it converts heterogeneous interface protocols, formats and user interfaces to a standard set of common interfaces and formats. It can also help in tracking costs of commodity and equipment purchases to optimize budgets.",
    "digital_function":"• Allows users to seamlessly send money anywhere to other users or other service functionalities providers • Distributes social service transfers and cash safely to end users • Creates eVouchers to disburse financial subsidies in a controlled and safe manner • Provides and manages eWallets to conduct financial transactions using different payment methods, such as a mobile phone application • Offers the ability to cash-in and cash-out from eWallets in an easy and accessible manner • Responds to payers with confirmation of payment, insufficient balance or a mismatch in credentials, transfer failure, etc, based on status in the backend applications • Posts status of transactions with traceability information into transaction logs • Tracks due payment and sent payment notifications through alerting mechanisms, along with associated information • Receives triggers for payment collection, posts the amount with relevant disclaimers to payer and obtains payer approval • Securely posts the approval, user ID and associated payment information to appropriate backend (eg mobile, debit/credit card, Internet banking entities) of relevant financial applications from banks, employers, insurance; awaits transfer confirmation from those applications • Searches and provides a logged information-based query of other applications • Tracks, compares and reports the cost of products, services across vendors, and seasons and regions for optimizing expense budgets • Can be easily integrated with any app with simple coding • Able to operate in remote and inaccessible locations",
    "sector_use":[{"name":"Agriculture sector","description":"• Agriculture commodities marketplace – use online payment services to remit farmers’ payment for commodity spot sales • Mobile agri-insurance enables farmers to buy insurance cover for crops via mobile payment and receive insurance claims directly to their mobile wallet or linked bank account"},
        {"name":"Education sector","description":"• Payment for online course enrolment • Fee payment systems for primary and secondary schools, universities, and other learning institutions • Payment for downloading proprietary electronic publications • Bursary payments to students"},
        {"name":"Health sector","description":"• Payment during booking of services • Downloading of electronic publications • Insurance claim settlements • Purchase of medicines or food, etc"}
    ],
    "existing_software":["Apache Fineract","Electronic Funds Transfers (EFT) from banks, credit card payments, and online payment services such as PayPal"],
    "workflow_mappings":["Client case management","Client education","Financial services","Marketplace","Procurement","Supply chain management"]
},{
    "name":"Registration",
    "other_names":"Enrolment services",
    "short_desc":"Records identifiers and other general information about a person, place or other entity, typically for the purpose of registration or enrolment in specific services or programmes and tracking of that entity over time.",
    "full_description":"Registration services attribute a unique functional ID to a person, place or other entity to identify and access information about it. According to the World Bank, functional IDs are those that evolve out of a single use-case, such as voter IDs, health records, or bank cards, and are created with a specific purpose in mind, differing from foundational IDs which are created with a general purpose in mind. Registration services can also use the foundational ID or map it to the functional ID where such an identity exists. Examples of specific registration services include immunization, disease and citizenship records, as well as birth and death registration. The ensemble of utilities for capturing, recording, profiling, searching, retrieving and verifying this identity information is encapsulated as registration services. The information itself will be deposited into and retrieved from corresponding functional registries (see the Registries ICT Building Blocks). Registration services help profile entities by enabling the registration of different categories or groups and documenting their access to various services. These services also onboard users into a programme or service offered by an organization (eg rural advisory service), capturing related demography, profile and citizen ID information.",
    "digital_function":"• Assign a unique (functional) ID and create identification pieces (eg smart card, bar functionalities code, RFID, digital token, unique number) with that ID and all related information about the entity • Map the assigned new (functional) ID to existing national (foundational) ID, if any • Populate demographic and/or geographic data of entities when registering for the first time • The complete registration information will be further used for any transaction or services later • This information can be used to complete the know your customer (KYC) requirements that businesses use to assess potential clients and comply with regulations • Capture identification information from biometrics, photos, scanned images, typed input, etc, and update the relevant registry with these entries using a specific ID tag • Determine if the specified ID exists in the registry according to a match with the given credentials • Automatically identify possible duplicate entries and merge them • Retrieve information corresponding to queries for a chosen entry, such as eligibility for subsidy, enrolment status, profile • Retrieve information of entries in the registry matching or nearly matching given credentials",
    "sector_use":[{"name":"Agriculture sector","description":"• Farmers’ registration in a rural advisory service (RAS) captures information about farming and other related areas (eg government schemes) • Registration mostly happens through mobile channels such as an interactive voice response system (IVRS), SMS or mobile apps • At the time of registration, critical personal, demographic and farming profile data is collected by the system through a registration form • This data is stored and used for customization of information delivery to users (per their profile) and other analytics • In some advanced RAS, the registration data is shared and mapped with other citizen databases (eg population registry, land registry) to facilitate delivery of multiple business services (eg microfinance)"},
        {"name":"Education sector","description":"• Registration for online professional development courses via the web or a mobile app • During registration, personal, educational and demographic data is required to help the system ascertain qualification levels • Doing so helps the system tailor course content in accordance with user needs"},
        {"name":"Health sector","description":"• Pregnant women’s registration into Mother Child Tracking System"}
    ],
    "existing_software":["OpenSRP"],
    "workflow_mappings":["Client case management","Client communication","Data collection and reporting","Identification and registration","Marketplace","Supply chain management"]
},{
    "name":"Reporting And Dashboards",
    "other_names":"Key performance tracker, Digital dashboard",
    "short_desc":"Provides pre-packaged and custom presentations of data and summaries of an organization’s pre-defined key performance metrics, often in visual format.",
    "full_description":"Reporting and dashboard services provide easy-to-understand aggregated key statistical data (mostly current and historical data) and summaries in visual formats such as charts, graphs and animations.",
    "digital_function":"• Allows the export and import of data and metadata that integrate with external functionalities applications through APIs • Provides different kinds of tools for data validation and improvement of data quality • Provides reports with charts and tables for selected indicators or data summaries, all of which are designed to be easy to use and create • Offers a configurable dashboard for quick access to relevant monitoring and evaluation tools, including indicator charts and links to favourite reports, maps and other key resources in the system • Constructs and runs queries by users on the underlying database to create custom reports • Allows users to share and discuss their data in charts and reports",
    "sector_use":[{"name":"Agriculture sector","description":"• Production of periodic reports for soil samples, fertilizer, seeds, pesticides, farmer registration statistics, and inspections"},
        {"name":"Education sector","description":"• Production of reports on educational key performance indicators, including learner performance, completion rates, retention, dropout rates, graduate passes and failure rates"},
        {"name":"Health sector","description":"• Production of aggregated statistics for the routine data a health facility uses for strategic planning within the health system • Management information system reports for hospitals, labs and other entities, supply chain tracking reports, patient feedback reports, medical test reports, etc"}
    ],
    "existing_software":["DHIS2","Tableau"],
    "workflow_mappings":["Client Case Management","Client Education","Content Management","Data Analysis and Business Intelligence","Data Collection and Reporting","Remote Monitoring"]
},{
    "name":"Scheduling",
    "other_names":"Appointment booking, Activity manager, Calendar management",
    "short_desc":"Provides an engine for setting up events based on regular intervals or specific combinations of status of several parameters in order to trigger specific tasks in an automated business process.",
    "full_description":"The scheduling services ICT Building Blocks provides an engine for setting up event or tasks. These tasks can be simple, one-time events, such as a referral appointment at a specialist clinic. More complex events may also be defined and configured with this component. Regular, repetitive events can be set up, including on-going calendar appointments scheduled at regular intervals to automate data acquisition and the processing, distribution, presentation and backup activities involved in a business process. This type of complex event uses a predefined schedule based on a set of status indicators at specific milestones along a Workflow that acts as triggers for actions. These triggers may be based on positive status (completion), or negative status (non-completion) of various activities. Milestones can be set at different intervals, so the next trigger may happen after a delay if the status has not changed from negative to positive.",
    "digital_function":"• Enable external applications to define events or tasks based on a defined time period functionalities and/or intervals • Allocate time slots based on resource availability • Bind different allocated resources into events • Enable blocking and releasing subslots in events • Search/sort/fetch/populate event or task information based on queries from other applications",
    "sector_use":[{"name":"Agriculture sector","description":"• Custom hiring services for agro-machinery, which enables farmers to schedule hiring for various farm activities (eg a combine harvester)"},
        {"name":"Education sector","description":"• Calendar service that schedules the school timetable, exam timetable, quarterly district official meetings, subject advisor visit schools and school evaluation meetings • Alerts are sent in advance of scheduled events as task reminders, such as reports and presentations that are due • Relevant forms required for submission of these types of documents are also sent with these alerts"},
        {"name":"Health sector","description":"• Booking appointments with providers • Planning medication, diet, exercise and follow-up consultations for patients and providers • Acquiring periodic measurements from medical monitoring devices • Supply chain management systems can organize shipments of medical commodities or equipment • Hospitals, public health departments, and organizations can announce new programmes or events to the public over mobile phones and social media • Facility managers can schedule regular maintenance checks on equipment or to generate periodic reports from management information systems"}
    ],
    "existing_software":["Cron","Django Celery"],
    "workflow_mappings":["Client communication","Supply chain management","Work planning and coordination"]
},{
    "name":"Security",
    "other_names":"Information security, Privacy, Access control",
    "short_desc":"Allows ICT administrators to centrally configure and manage user and group access permissions to network resources, services, databases, applications and user devices. It also enables secure information exchange between different applications.",
    "full_description":"In general, the information security services ICT Building Blocks uses a group of methods to intelligently control access to resources, enforce policies, secure information, and log/audit who has accessed what resource and for what purpose. When dealing with information security, there are several key capabilities that need to be considered. These capabilities can be implemented and leveraged at a local solution level, scaled up to an enterprise wide solution, or any combination in between. There are four key capabilities necessary to enable better management and use of electronic information so as to facilitate secure storage and the exchange of data between consumers, vendors and other organizations. This data exchange will need to be conducted in ways that safeguard the availability, integrity, confidentiality and accuracy of the information. Access management: Following identification and authentication of users, this ICT Building Blocks controls user access to resources within a system (country, network, enterprise or individual solution) by associating user rights and restrictions with the established identity. Cryptography and digital signatures: An essential part of any communication transmitted over an untrusted or insecure medium, including different types of networks and especially the Internet. Cryptography can serve many purposes, including: • Authentication – proving one’s identity • Privacy/confidentiality – ensuring only the intended message recipient can read the message • Integrity – ensuring that the message has not been altered in transit from the sender to the receiver • Non-repudiation – ensuring neither sender nor receiver cannot deny their actions on completion Logging, auditing and attribution: This provides traceability and documentary evidence of a sequence of actions. This process can and should contain actions such as system login, information access and system restarts, among many others. Single sign-on: Allows users who have different usernames and passwords for each application to authenticate themselves for multiple applications using the same sign-in credentials.",
    "digital_function":"• Restriction of connection to only those devices and applications that have been functionalities certified as conforming to standards • Filtering of credentials to allow only authorized systems and personnel to access and perform specific operations on data • Anonymization of documents by removing personal identity information • Encryption of data in storage or transmission to prevent illegal tapping or copying of information for parties other than the authentic destination • Detection and restriction of normal and abnormal patterns in data access and operations",
    "sector_use":[{"name":"Agriculture sector","description":"• SSL digital certificate-based payment gateway to enable financial transactions in agriculture eMarketplace"},
        {"name":"Education sector","description":"• Multi-password management systems in schools for secure storage of passwords and sensitive data"},
        {"name":"Health sector","description":"• SSL digital certificate-based permission for uploading digital documents to servers from client systems • Role-based access control in hospital information systems that prevents unauthorized persons from accessing content • HL7/DICOM messaging for transmission of anonymized data • MAC-id-based access control protocols for allowing only authorized machines to access or operate medical or financial records • ePayment applications verify the digital signature of the payer, or diagnostic tests check the digital signature of doctors for authenticating medical reports in insurance claims • Biometric passwords may be used for health workers accessing eLearning tools, patient data, etc via mobile devices and computers"}
    ],
    "existing_software":["OpenSSL"],
    "workflow_mappings":["Security is an important consideration in all WorkFlows","Client case management","Client education","Content management","Data analysis and business intelligence","Identification and registration","Knowledge management","Marketplace"]
},{
    "name":"Shared Data Repositories",
    "other_names":"Shared domain repositories",
    "short_desc":"Shared space to store data for a specified knowledge area that external applications use, often providing domain-specific functionality and data presentations.",
    "full_description":"The shared data repositories ICT Building Blocks is one of the most important components, as it provides a common place to store data that external applications can use. Repositories support the storage, retrieval, management and exchange of data between different applications. The goal of repositories is to make data available for any authorized application that needs to use it. Access to repositories must follow countries’ data privacy and user consent regulations. Repositories make data available and accessible through interoperable interfaces. Metadata information is used to classify data in these repositories in terms of types of data, domains of value, critical values (syntactic information) and meaning of data (semantic description).",
    "digital_function":"• Allows external applications to change (by adding, modifying or removing data) functionalities without losing the information itself • Ensures that information flows when it is needed to where it is needed, and with whom it is authorized to be shared • Enables client, or their authorized representative, with partial or full access to their own records, or to capture input from medical or mobile devices • Establishes cross relationships and linkages between different data points to enable ready access to related clusters of data stored in disparate locations • Ensures privacy through automated rules for access and operation for data sharing",
    "sector_use":[{"name":"Agriculture sector","description":"• Plant pest database, such as the US Department of Agriculture’s Animal and Plant Health Inspection Service’s (APHIS) new, searchable database, known as the Fruits and Vegetables Import Requirement (FAVIR) database • This database is accessed by other software such as those related to plant protection and quarantine to assess the pest risk profile of agro-commodities imported from different countries • Pest map, crop coverage and weather data are combined to create pest propensity modelling and index-based insurance packages for farmers"},
        {"name":"Education sector","description":"• Repositories of learner profiles and progression records accessible across government systems"},
        {"name":"Health sector","description":"• Shared health record: Collection of patient records typically provided by many clinically related systems, made available for consumption by those who have the necessary rights and need to see the information. The systems or applications used by insurers or payers of subsidized care may be given partial access to shared health records in order to approve payment for services • Encounter: Data pertaining to an interaction between a patient and healthcare provider for the purpose of assessing the health status of a patient or for providing patient services • Clinical documentation: Component of the patient’s medical record that documents clinical observations and services • Medications: Information pertaining to a patient’s medication history. This includes those medications taken at home, prescribed medications, and also those administered in care settings such as a hospital or an outpatient clinic • Immunizations: Records of a patient’s immunization history • Laboratory: Contains the results of laboratory tests performed on clinical specimens • Imaging: Contains records of diagnostic imaging as well as clinician notes and other information stored with the images • There may also be repositories of insurance claims, subsidies, or out-of-pocket payments linked to health service records"}
    ],
    "existing_software":["World Bank Open Data"],
    "workflow_mappings":["Client case management","Client education","Content management","Data analysis and business intelligence","Knowledge management"]
},{
    "name":"Terminology",
    "other_names":"Thesaurus, Ontology services",
    "short_desc":"Registry of definitions and terms with defined nomenclature standards, metadata, synonyms and sometimes a knowledge map for a particular domain of knowledge (eg agriculture), used to facilitate semantic interoperability.",
    "full_description":"The terminology services ICT Building Blocks helps ensure that data passed through applications in the system are coded and classified in the same way. These services help establish, search, verify and view the vocabulary stored in codified reference lists according to standardized nomenclature and data formats. Terminology services components can disseminate standards and facilitate the management of changes in standards over time. Many applications use their own local terminologies, but these may need to be mapped to the standard reference terminologies in a time-consuming manual process. Terminology services may use push or pull interfaces to other applications, depending on the implementation, to ensure data exchanged through them is interpreted, aggregated, analyzed and compared without loss in accuracy. This ICT Building Blocks lets users of an application make use of codes and value sets without having to become experts in the fine details of a particular coding system and terminologies.",
    "digital_function":"• Allows external applications to access or search for standard terminology along functionalities with explanations and cross-mapping to local terminologies, if any • Offers source-related terminologies for a given term in the dictionary • Provides metadata and meta-description for the terms • Ensures interoperability of data between cross-sectoral applications (eg vector pest data between agriculture and health)",
    "sector_use":[{"name":"Agriculture sector","description":"• FAO Agrovoc is the main terminology standard in agriculture • It is a controlled vocabulary covering all areas of interest including food, nutrition, agriculture, fisheries, forestry and environment • It is published by FAO and edited by a community of experts • Apart from Agrovoc, Pesticide Environmental Stewardship (PES) by Cornwell University has a glossary of terms related to pesticides • Population census (definition of income group, standards related to type of housing, and terminology such as literate and semi-literate)"},
        {"name":"Health sector","description":"• Several terminology reference standards such as DICOM, HL7, ICD-10/PCT, LOINC, etc are used widely for payments and insurance claims processing as well as different supply chain applications"}
    ],
    "existing_software":["Open Concept Lab"],
    "workflow_mappings":["Client education","Data analysis and business intelligence"]
},{
    "name":"Workflow And Algorithm",
    "other_names":"Business process automation services",
    "short_desc":"Helps to optimize business processes by specifying rules that govern the sequence of activities to be executed as well as the type of information exchanged in order to orchestrate the process flow from its initiation to completion.",
    "full_description":"The WorkFlow and algorithm services ICT Building Blocks helps automate and control the flow of information and activities within various services based on predefined protocols. In some cases, these protocols may include directives for end users, such as treatment guidelines or operating procedures. In other cases, these WorkFlows may guide software systems to automate data exchange based on certain events or conditions. By allowing different applications to exchange information, it can support cross-facility WorkFlows and business processes. In addition to accelerating and automating information flow, it can be used as a mechanism to encourage or enforce best practices, clinical guidelines and policy.",
    "digital_function":"• Provides digital definitions of various WorkFlows as a sequence of various functionalities transactions and tasks executed by specific user roles as well as the combination of events that should trigger transition from one task or user to another • Captures events and inputs from external applications and then groups these into specific assessment pools as specified by WorkFlow transition rules • Evaluates trigger conditions for movement of WorkFlow through specific task or user transitions based on predefined rules • Notifies changes in activities or changes of users to other applications • Supplies the contextual information needed to effect the transition of tasks or users",
    "sector_use":[{"name":"Agriculture sector","description":"• Farm management systems use many WorkFlows related to various agronomic activities, such as fertilizer application and irrigation"},
        {"name":"Health sector","description":"• Worklist tracking and reminding • Clinical decision support algorithms • Evaluation and processing of financial subsidy or insurance claims • Electronic collection or remittance of payments"}
    ],
    "existing_software":["Drools","Zapier"],
    "workflow_mappings":["Client case management","Data analysis and business intelligence","Problem diagnosis","Procurement","Work planning and coordination"]
}]