[ {"name":"Design with the User","slug":"design_with_the_user", "url":"https://digitalprinciples.org/principle/design-with-the-user/", "description":"{\"ops\": [{\"insert\": \"Successful digital initiatives are rooted in an understanding of user characteristics, needs and challenges. User-centered design — also referred to as design thinking or human-centered design — starts with getting to know the people you are designing for through conversation, observation and co-creation. Information gathered through this engagement leads to building, testing and redesigning tools until they effectively meet user needs. By designing with the users, and not for them, you can build digital tools to better address the specific context, culture, behaviors and expectations of the people who will directly interact with the technology. Designing together means partnering with users throughout the project lifecycle, co-creating solutions, and continuously gathering and incorporating users’ feedback.\n\"}]}"},
  {"name":"Understand the Existing Ecosystem","slug":"understand_existing_ecosystem", "url":"https://digitalprinciples.org/principle/understand-the-existing-ecosystem/", "description":"{\"ops\": [{\"insert\": \"Well-designed initiatives and digital tools consider the particular structures and needs that exist in each country, region and community. Dedicating time and resources to analyze the ecosystem, or context where you work, helps to ensure that selected technology tools will be relevant and sustainable and will not duplicate existing efforts. Ecosystems are defined by the culture, gender norms, political environment, economy, technology infrastructure and other factors that can affect an individual’s ability to access and use a technology or to participate in an initiative. Initiatives that do not account for ecosystem challenges are less likely to achieve their objectives or scale. This may also lead to unintended consequences. The ecosystem is fluid, multifaceted and ever-changing, requiring that digital development practitioners regularly analyze the context to check their assumptions.\n\"}]}"},
  {"name":"Design for Scale","slug":"design_for_scale", "url":"https://digitalprinciples.org/principle/design-for-scale/", "description":"{\"ops\": [{\"insert\": \"Achieving scale is a goal that has been elusive for many digital development practitioners. The mHealth field, for example, has identified the problem of pilotitis, or the inability to move initiatives beyond pilot stage. Achieving scale can mean different things in different contexts, but it requires adoption beyond an initiatives pilot population and often necessitates securing funding or partners that take the initiative to new communities or regions. Different implementers may define scale as reaching a certain percentage of a population or a certain number of users. Designing for scale means thinking beyond the pilot and making choices that will enable widespread adoption later, as well as determining what will be affordable and usable by a whole country or region, rather than by a few pilot communities. You may need to evaluate the trade-offs among processes that would lead to rapid start-up and implementation of a short-term pilot versus those pilots that require more time and planning but lay the foundation for scaling by reducing future work and investment.  By designing for scale from the beginning, your initiative can be expanded more easily to new users, markets, regions or countries if the initiative meets user needs and has local impact.\n\"}]}"},
  {"name":"Build for Sustainability","slug":"build_for_sustainability", "url":"https://digitalprinciples.org/principle/build-for-sustainability/", "description":"{\"ops\": [{\"insert\": \"Building sustainable programs, platforms and digital tools is essential to maintain user and stakeholder support, as well as to maximize long-term impact. Sustainability ensures that user and stakeholder contributions are not minimized due to interruptions, such as a loss of funding. A program built for sustainability is more likely to be embedded into policies, daily practices and user workflow. For many digital initiatives, institutionalization by a nongovernmental organization, private company or local government is the ultimate goal in achieving long-term, positive impact. For others, institutionalization is achieved by developing a business model that has sustainable revenue generation.\n\"}]}"},
  {"name":"Be Data Driven","slug":"be_data_driven", "url":"https://digitalprinciples.org/principle/be-data-driven/", "description":"{\"ops\": [{\"insert\": \"No amount of data will lead to accelerated impact if it is not used to inform decision making. When an initiative is data driven, quality information is available to the right people when they need it, and they are using those data to take action. The data produced by a digital initiative should be used for more than just outputs, such as published work or donor reporting. Examples of the types of data that can be collected to inform decision making include surveillance, research, operations, project management and data from secondary sources collected outside of the program.\n\"}]}"},
  {"name":"Use Open Standards, Open Data, Open Source, and Open Innovation","slug":"use_open_standards", "url":"https://digitalprinciples.org/principle/use-open-standards-open-data-open-source-and-open-innovation/", "description":"{\"ops\": [{\"insert\": \"Too often, scarce public and international development resources are spent investing in new software code, tools, data collection, content and innovations for sector-specific solutions that are locked away behind licensing fees, with data only used by and available to specific initiatives. An open approach to digital development can help to increase collaboration in the digital development community and avoid duplicating work that has already been done. Programs can maximize their resources — and ultimately their impact — through open standards, open data, open source technologies and open innovation. By taking advantage of existing investments when you are able, you can apply finite digital development resources toward creating global goods. What being “open” means for your initiative will depend on practical and technical constraints, security and privacy concerns, and the dynamics of the people and networks in your space. For example, to what extent your initiative uses open source software will depend on the needs identified for your context and an assessment of which of the available options best meets those needs, factoring in their total cost of ownership.\n\"}]}"},
  {"name":"Reuse and Improve","slug":"reuse_and_improve", "url":"https://digitalprinciples.org/principle/reuse-and-improve/", "description":"{\"ops\": [{\"insert\": \"Instead of starting from scratch, programs that “reuse and improve” look for ways to adapt and enhance existing products, resources and approaches. Reuse means assessing what resources are currently available and using them as they are to meet program goals. Improve means modifying existing tools, products and resources to improve their overall quality, applicability and impact. Start by identifying relevant methods, standards, software platforms, technology tools and digital content that have already been tried and tested. You can learn about digital development tools that have been piloted or scaled through conferences, blogs, program evaluations and the digital development community. While an existing tool or approach may not exactly fit all your needs for reuse, consider improving and building on it, rather than creating something entirely new. The result is a tool that is now better and more reusable by all because of your improvements. Reusing and improving is not about designing shiny new objects or limiting a technology to internal use; it is about taking the work of the global development community further than any organization or program can do alone. Reusing and improving can also dramatically reduce the time needed for development and testing, and reduce your costs.\n\"}]}"},
  {"name":"Address Privacy and Security","slug":"address_privacy_security", "url":"https://digitalprinciples.org/principle/address-privacy-security/", "description":"{\"ops\": [{\"insert\": \"Addressing privacy and security in digital development involves careful consideration of which data are collected and how data are acquired, used, stored and shared. Organizations must take measures to minimize collection and to protect confidential information and identities of individuals represented in data sets from unauthorized access and manipulation by third parties. Responsible practices for organizations collecting and using individual data include considering the sensitivities around the data they have collected, being transparent about how data will be collected and used, minimizing the amount of personal identifiable and sensitive information collected, creating and implementing security policies that protect data and uphold individuals’ privacy and dignity, and creating an end-of-life policy for post-project data management.\n\"}]}"},
  {"name":"Be Collaborative","slug":"be_collaborative", "url":"https://digitalprinciples.org/principle/be-collaborative/", "description":"{\"ops\": [{\"insert\": \"Being collaborative means sharing information, insights, strategies and resources across projects, organizations and sectors, leading to increased efficiency and impact. This Principle brings all the others together in practice. People working in digital development have a shared vision to create a better world, and collaboration is essential to making this vision a reality. No single initiative or organization can make it happen alone. We have the most impact when we work together across geographies, focus areas and organizations and in partnership with local communities and governments. By collaborating, those working in digital development and beyond can pool their resources and expertise not only to benefit each initiative but also to strengthen the global community. Collaborating does not just happen accidentally; it requires time, planning and dedicating resources to look for and develop opportunities.\n\"}]}"}
]

