[{"name":"Data Analysis and Business Intelligence","slug":"data_analysis_and_business_intelligence","created_at":"2019-06-25T14:29:59.789028","updated_at":"2019-09-06T18:03:51.972834","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Defining aggregate functions across samples of data values, creating alerts around anomalous or statistically significant events or occurrences in the data.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Throughout any programme lifecycle of engagement with citizens, different departments/projects need to monitor and analyze the progress of certain activities to identify and promote best practices, course corrections and interventions as needed for continuous improvement in effectiveness, efficiency and sustainability of activities. Data analysis and business intelligence WorkFlow provides this functionality. Common data analysis and business intelligence activities include analysing samples from relevant groups of parametric values to derive statistical and combinatorial indicators, and then analysing the indicators to identify and flag abnormal events/ trends and relevant parties. They can subject the information to preset thresholds to determine whether escalation is required or not, and accordingly trigger notification/ alert mechanisms to proactively/reactively inform authorized users.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Data mining, Dashboards and alerts\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Assess trends in rural farm productivity based on crop, proximity to market and other factors, such as weather\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Analyze effectiveness of learning programmes in resulting in the development of new skills or competencies\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Evaluate the impact of successful completion of maternal and newborn health programme on maternal and newborn mortality reduction\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Data Collection and Reporting","slug":"data_collection_and_reporting","created_at":"2019-06-25T14:29:59.826066","updated_at":"2019-09-06T18:04:14.382182","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Defining, collecting, validating, normalizing and aggregating structured data of all kinds (often to replace paper forms): text, numeric, geospatial or multimedia.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"This generic WorkFlow or business process concerns the collection and reporting of data that almost every organization needs in order to support decision-making and planning. It is also used to generate operational performance indicators for the service delivery process. For example, data collection activities can focus on the environment to help promote public health safety and hygiene; gather information such as sowing date, sowing area of crops, and livestock age, sex and vaccination records; and track health information such as malaria cases or disease outbreaks. Common data collection and reporting activities include the capture of different types of data, such as text, sensory and multimedia data; normalization of formats from various sources into standardized measurement units; data aggregation; grouping measurements of different parameters into sets for various applications; and presenting data in corresponding report formats.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Surveying, Surveillance\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Collect commodity price data from major marketplaces\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Collect data on service use and results of visits\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Record student performance and feedback on teaching\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Decision Support","slug":"decision_support","created_at":"2019-06-25T14:29:59.868435","updated_at":"2019-09-06T18:04:40.219589","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Applying generic aggregation or analytical algorithms to raw data, combining these results with domain-specific business knowledge, to produce strategic, actionable insights or alerts.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"This WorkFlow involves a process of analysing data and parameters to produce meaningful information or inferences (models), which help in decision-making (for humans). Decision support can be purely analytical or cognitive (eg deep learning). Examples of decision support include crop pest alert systems, clinical decision support systems, etc. Common decision support WorkFlow involves capturing raw data using collection tools; filtering the data through the application of algorithms to extract parametric values; and interfacing with analytics and business intelligence tools for combinatorial and statistical analysis of parameters. This allows specific indicators of symptoms, behaviour, and outcomes of the system to be obtained, and to interface with knowledge management tools to interpret the situation, and predict possible causes, future outcomes and suggestions for corrective actions if any. It can also learn and improve the accuracy of interpretation, prediction and correction using feedback collected from users, and by tracking system responses to corrective actions.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Analytics\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Support decision making on harvest timing and best seed selection based on local conditions\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Data-driven analysis of teacher and student performance for informed school development\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Analyze test results to determine treatment/therapy planning\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Financial Services","slug":"financial_services","created_at":"2019-06-25T14:29:59.879114","updated_at":"2019-09-06T18:05:03.404097","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Integration between an organization, its beneficiaries, and the ability to automate banking service functions between the two.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Many organizations need to enable certain financial services with a broad range of stakeholders that can be individuals, banks, credit-card companies, insurance companies, merchants, and government organizations. Financial services may involve remittances, credit, savings, insurance, reimbursements, vouchers, paying bills and invoices, subsidies, etc. Financial services WorkFlow enables smooth cashless secure transactions and simple and rapid transfer of funds.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"eCommerce, Payment platforms\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Register and assign unique identifiers to farm, farmer, and household\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Use Case Education: Remote learning: \"},{\"insert\":\"Register and assign unique identifier to remote learner\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Register and assign unique identifiers for mother and newborn\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Identification and Registration","slug":"identification_and_registration","created_at":"2019-06-25T14:29:59.904028","updated_at":"2019-09-06T18:05:25.867556","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Uniquely identify and collect other pertinent information about people and relevant business objects (inventory, locations, or events) for any particular business process.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Organizations need to register persons, facilities, professionals, equipment, procedures, etc in such a way as to be able to uniquely identify them, access their information and grant appropriate access and permissions to transact with them. Identification and registration WorkFlow enable the creation of ‘functional registries’ which provide directory services for different purposes. During the registration process, a unique identifier of an entity is attributed, basic profiling (demographic and/or geographic) information is collected and identity is mapped to already existing national identifiers if any. Registration WorkFlows ensure the enrolment of entities in different programmes and their access to certain entitlements.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Onboarding\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Register and assign unique identifiers to farm, farmer, and household\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Register and assign unique identifier to remote learner\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Register and assign unique identifiers for mother and newborn\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Content Management","slug":"content_management","created_at":"2019-06-25T14:29:59.74846","updated_at":"2019-09-06T18:03:28.883141","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Create, organize, publish and secure content (text and multimedia) to make it easier to navigate and retrieve throughout an organization.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Most organizations need to create/access/populate content in different (digital) formats including text, images, video, audio, etc, stored in various locations and that have to be distributed securely from/to various entities. Content management WorkFlow therefore manages and organizes different types of multimedia content along with the mechanisms to access and operate on it as key assets of the organization. It also enforces policies for information security, privacy, storage, retention, optimization, transmission, quality, etc, and enables its indexing, searching, sorting, access control, compression, encryption, replication and anonymization.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Content digitization\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Manage content customized to farmer needs based on language, geographical region, education-level, or other attributes\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Providing relevant, timely content for literacy learners\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Store and retrieve educational and promotional content for use during field visits\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Client Communication","slug":"client_communication","created_at":"2019-06-25T14:29:59.660224","updated_at":"2019-09-06T16:51:59.746703","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Bulk or individual communication between businesses and their clients or between individuals using a variety of channels, such as email, short messaging service, interactive voice response, or social media.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"All organizations need to communicate with their end-users to share information, influence behaviour changes or get feedback. Communication may be targeted to a certain user or certain profile of users or be untargeted (mass communications). It can also be one-way or two-way (interactive) communication. It can serve to send alerts and notifications in real time in case of emergencies, or can be based on specific conditions or time intervals.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Campaigning, Promotion, Marketing, Awareness raising\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Automated notification of harvest schedule, market prices for subscribed products, and weather/natural disaster updates\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Reminders for assignment due dates, new course material availability, etc\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Sending appointment reminders, receiving questions from mothers\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Client Case Management","slug":"client_case_management","created_at":"2019-06-25T14:29:59.60146","updated_at":"2019-09-06T18:02:31.735747","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Enrolment, tracking and monitoring of services provided to a beneficiary or household, often across multiple service categories.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"The client case management WorkFlow involves the registration or enrolment of a user and the longitudinal tracking of services for that user often across multiple service categories, multiple service providers, and multiple locations. Users may avail themselves of one or more services from the organization. Services may be delivered by one or more providers at different points in time. From initial client registration, all services booked, availed of, or cancelled, along with transactional history and status, often need longitudinal tracking to avoid confusion across the multiple service categories, multiple service providers, and multiple locations and schedules that the client may be associated with as they journey through different organizations. Common case management WorkFlow includes capturing client and demographic information, appointment and event scheduling, messaging and reminders, management and prioritization of tasks across multiple cases, and summarizing client case data for reporting. Case managers commonly employ one or more job aids, each facilitating a particular service, and potentially customized according to client attributes.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Beneficiary case management\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Tracking of market transactions\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Enrolment in training programmes and tracking progress over time. Track beneficiaries progress through course material\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Tracking of antenatal attendance, birth outcome and immunizations\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Knowledge Management","slug":"knowledge_management","created_at":"2019-06-25T14:29:59.945983","updated_at":"2019-09-06T18:05:48.251086","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Collect, sort, and archive organizational assets for easy retrieval and assimilation.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Common knowledge management WorkFlow enables the collection, assimilation, classification, linking, searching, sorting and distribution of information assets automatically or on demand to provide meaningful knowledge that can be converted easily into action. Most organizations are involved in knowledge management activities to enhance business processes, build user capacities and improve user experience. They can help to share experiences, predict situations, register/propose best practices in various situations and supply relevant information for decision support. The knowledge management process also link researchers and those who have experience and skills with those who need them.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Information architecture\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Management of information resources about national and international best practices, crop yields, and rural extension programmes\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Repository of teacher resources, such as exercises, student handouts, and assignments\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Management of health information resources for mothers and their households, and for their caregivers\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Client Education","slug":"client_education","created_at":"2019-06-25T14:29:59.697844","updated_at":"2019-09-06T18:03:01.474505","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Creation and dissemination of educational content for training or to promote awareness of a topic.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Several organizations need to educate their users with knowledge targeted at developing specific skills or behavioural changes, or enhancing public awareness about a topic, service or programme. In most cases, they use a course or programme’s educative content, which is delivered inside or outside of a traditional classroom or educational institution. It could also include information and illustrative content to create awareness about specific concepts, services and facilities. It uses assessment tools to evaluate the achievement of learning objectives. Common examples of client education include the training of field workers supporting users in adopting new processes, introducing women to the importance of and facilities for hygiene management, family planning and institutional assistance for managing pregnancy, or for supporting formal education in educational institutes.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Learning\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Enrolment in training programs to access market services to improve profitability\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Creation and dissemination of all course materials\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Information about facility-based deliveries, the importance of pre- and post-delivery care and scheduled vaccinations\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Marketplace","slug":"marketplace","created_at":"2019-06-25T14:29:59.970695","updated_at":"2019-09-06T18:06:13.199225","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"A discovery platform between buyers and sellers, allowing for easy transactions of goods and services.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Many organizations need to enable marketplaces where buyers and sellers can discover each other, negotiate contracts, buy or sale goods and services and make payments to each other. Marketplaces operate on various models depending on the needs of buyers and sellers. Primarily there are three kinds of marketplaces: business-to-consumer (also government-to consumer); business-to-business; and consumer-to-consumer. Key activities in a marketplace are registration by buyers and sellers, who are authenticated by the marketplace operators. It also allows for product, service and price discovery, buyer-seller interaction, payment transaction, fulfilment and after sales support. Marketplace WorkFlow enables promotion and awareness to users about the marketplace, registration of buyers and sellers, identification and authentication of users, and the sending of transactional updates (eg payment processed, shipments, etc) to transacting parties, as well as actuating financial transactions between buyers and sellers or buyers and marketplace operators.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Trade, commerce\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Buying and selling of agricultural goods and products\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Marketplace for academic textbooks\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Buying and selling of birth preparedness products and related health items\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Problem Diagnosis","slug":"problem_diagnosis","created_at":"2019-06-25T14:29:59.999131","updated_at":"2019-09-06T18:06:38.555415","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Build a model of hypothetical diagnoses, iteratively incorporating new data and eliminating invalid diagnoses.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Problem diagnosis WorkFlow involves an iterative process of collecting data and drawing inferences based on predefined algorithms or rules. In this process, a hypothesis about a set of possible causes is inferred based on observable facts (symptoms) and then iteratively the most unlikely causes are ruled out as more and more observable facts are collected, so that in the end, one (or very few) most probable causes can be inferred. A common example of problem diagnosis is identifying nutrient deficiency in plants by observing leaf colours and leaf or fruit damage.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Troubleshooting\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Identify nutrient deficiency in plants by observing leaf colours or leaf/fruit damage\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Support teacher in identifying and addressing student learning challenge\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Identify signs of behavioural disorders by incorporating pertinent EHRs.\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Procurement","slug":"procurement","created_at":"2019-06-25T14:30:00.015507","updated_at":"2019-09-06T18:07:28.162427","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Management of business functions of procurement planning, purchasing, inventory control, traffic, receiving, incoming inspection and salvage operations.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Almost all organizations are involved in the procurement of consumables, equipment, raw materials, etc. They engage with a large network of purchasing and consuming entities all along a supply chain. Common procurement activities include supporting users in searching and maintaining lists of preferred products and suppliers; aggregating internal demand for various commodities and raising procurement requests; getting and comparing price quotes and terms/conditions; placing orders; receiving bills; triggering payment services; and posting procured items into an inventory management system.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Inventory management\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Identify local suppliers for seed, fertilizer, and related products\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Bulk acquisition of school supplies and equipment\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Ordering commodities such as pharmaceuticals\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Remote Monitoring","slug":"remote_monitoring","created_at":"2019-06-25T14:30:00.038331","updated_at":"2019-09-06T18:07:59.206316","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"The automated collection of real-time (often time-series) data of remote person or object for status check or receiving emergency alerts.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"This WorkFlow involves real-time collection of data about a person, an object or an event, without being physically present, exchanging such collected data with other persons or machines and producing inferences in terms of diagnosis report, analytics, etc. Common examples of remote monitoring include remote field monitoring through in-situ and remote sensors, and remote patient monitoring.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Distributed sensing\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Record remote weather station data for forecasts and weather alerts\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Monitor student device usage during remote closed-book exam\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Monitor cold chain equipment status\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Supply Chain Management","slug":"supply_chain_management","created_at":"2019-06-25T14:30:00.052016","updated_at":"2019-09-06T18:08:23.386018","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"The design, planning, execution, control and monitoring of all supply chain activities with the objective of creating net value and synchronizing supply with demand, including avoiding stockouts, minimizing wastage, and providing an audit trail.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"Several types of products travel in a supply chain from manufacturers to wholesalers, retailers and end consumers. This WorkFlow optimizes shipment logistics and delivers goods efficiently without loss of quality all the way from the manufacturer to the end consumer, avoiding wastage and associated losses. For example, vaccines have short expiry periods and can become impotent or adversely potent even before expiry dates, if exposed beyond a narrow range of temperature, humidity and brightness of light. Common supply chain management WorkFlow comprises utilities to enable entities across the value chain to receive and respond to customer enquiries; collect and aggregate supplies of different orders based on delivery schedules and geographical regions; organize and track the location and safety of storage conditions; manage stock levels to avoid shortages; track consignments against delivery schedules; and track undelivered inventories against expiry dates, all along the supply chain.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Track, manage and optimize all aspects of a supply chain, including avoiding stockouts, minimizing wastage, and providing an audit trail.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Manage supply of seed and shipment and export of harvested crop\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"National distribution of school supplies and equipment to public education facilities\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Manage delivery of supplies to the beneficiary\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
,{"name":"Work Planning and Coordination","slug":"work_planning_and_coordination","created_at":"2019-06-25T14:30:00.084525","updated_at":"2019-09-06T18:08:51.944186","description":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"Short Description: \"},{\"insert\":\"Orchestrate the coordination and timing of activities of teams and team members within an organization.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Full Description: \"},{\"insert\":\"The delivery of services involves the execution of several activities on both the user and the provider side in a planned WorkFlow with contingencies to absorb uncertainties and variable dependencies. Work planning and coordination WorkFlow provides this functionality. Common work planning and coordination WorkFlow enables the provider side in planning and allocating appropriate resources for various services; managing customer appointments; tracking delivery; managing field workforce; triggering settlements thereof, etc; and enabling users to book and track their service appointments.\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Other Names: \"},{\"insert\":\"Project management, Task tracking\\n\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Sample mappings of workflows to use case:\"},{\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Agriculture: Market linkage: \"},{\"insert\":\"Coordination of market vendors seasonally to accommodate bulk purchasing and sales\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Education: Remote learning: \"},{\"insert\":\"Initiate scheduling of phone screening interview between student and enrolment advisor based on student’s stated interest in an advanced course\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"attributes\":{\"bold\":true},\"insert\":\"Health: Maternal and newborn health: \"},{\"insert\":\"Automate follow up with provider and patient for missed appointments or upon availability of laboratory test results\"},{\"attributes\":{\"list\":\"bullet\"},\"insert\":\"\\n\"},{\"insert\":\"\\n\"}]}"}
]